Revit 2026 API

# HostObjectSubcomponentInfo Class

---

A class that contains roof or floor slab information, calculated by ExporterIFCUtils.ComputeSubcomponents().

SystemObject Autodesk.Revit.DB.IFCHostObjectSubcomponentInfo

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HostObjectSubcomponentInfo : IDisposable
```
```vb
Public Class HostObjectSubcomponentInfo
	Implements IDisposable
```
```cpp
public ref class HostObjectSubcomponentInfo : IDisposable
```
```fsharp
type HostObjectSubcomponentInfo =
    class
        interface IDisposable
    end
```

The HostObjectSubcomponentInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreaOfCurveLoop | The area of the CurveLoop of the roof or floor slab. |
|  | Depth | The depth of the roof or floor slab. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LoopFace | The face of the loops of the roof or floor slab. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the HostObjectSubcomponentInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurveLoop | Gets the CurveLoop representing the base profile curve loop of the roof or floor slab |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPlane | Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A slab is an extrusion with one outer and no inner base profile curve loops, created by extruding the base profile loop in the direction Plane.Normal a distance given by the Depth value.

#### Reference

Autodesk.Revit.DB.IFC Namespace